source/_posts/2014-08-13-2014-golden-gate-ruby-conference.html
---
layout: post
title: "2014 Golden Gate Ruby Conference"
date: 2014-08-13 14:25:57 -1000
comments: true
categories: 
keywords: 
description: 
---

<p>
Woo hoo! I'm going to the <a href="http://gogaruco.com/">2014 Golden Gate Ruby Conference</a>. It's at UCSF Mission
Bay, San Francisco, September 19-20, 2014. I wrote an article about my
experience last year, <a href="http://www.railsonmaui.com/blog/2013/09/22/gogaruco-2013/">GoGaRuCo 2013: Community &gt; Code</a>. If you're on the fence
about attending, here's my top reasons on why you should consider attending. I
recommend not delaying <a href="http://gogaruco.com/registration/">signing up</a>, as last year I saw folks begging for tickets
once the conference sold out. According to <a href="https://twitter.com/wifelette">Leah Silber</a>, one of the <a href="http://gogaruco.com/about/">conference
organizers</a>, GoGaRuCo has sold out every year, except for <i>maybe</i> year one.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Top 10 Reasons To Attend GoGaRuCo</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>San Francisco is a great town to visit, and there's no better month to visit
than September as dense fog is least likely!
</li>
<li>It's relatively small conference, compared to Rails Conf, and I find that
<b>much more engaging and relaxing</b>. The attendees seem to be a mix of highly
passionate Rubyists, mostly locals, with a mix from around the world.
</li>
<li>A one track conference is nice in that you don't have to worry about picking
which talks to attend.
</li>
<li>There's a 15 minute break between each talk to socialize with fellow
attendees or speakers. Socializing is why you come to these talks!
</li>
<li>Yehuda will likely come up with some interesting talk!
</li>
<li>Ruby programming is really more of an art and passion than work, and the
people that attend GoGaRuCo reflect this!
</li>
<li>You'll probably make a few new friends and leave inspired.
</li>
<li>The food is super, both at the conference and throughout the city. And the
evening events last year were great as well.
</li>
<li>There's probably going to be a job board, just in case that interests you.
</li>
<li>You won't need any more T-shirts for another year!
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Photography</h2>
<div class="outline-text-2" id="text-2">
<p>
I'm volunteering as the official photographer of GoGaRuCo. My mission is to "get
2-3 good shots of each speaker, a couple of audience shots during each days
lunch and breaks, a shot or two of each exhibitor table, 2-3 team photos, and a
smattering of everything else." So please don't be shy and ask to have your
photograph taken.
</p>

<p>
Here's a sample of shots I took at GoGaRuCo 2013. Tons more photos are linked
here: <a href="http://www.railsonmaui.com/blog/2013/09/22/gogaruco-2013/">GoGaRuCo 2013: Community &gt; Code</a>.
</p>

<p>
{% img /images/2014-08-13-2014-golden-gate-ruby-conference/gogaruco-2013-1.jpg %}
</p>

<p>
{% img /images/2014-08-13-2014-golden-gate-ruby-conference/gogaruco-2013-2.jpg %}
</p>

<p>
{% img /images/2014-08-13-2014-golden-gate-ruby-conference/gogaruco-2013-3.jpg %}
</p>

<p>
{% img /images/2014-08-13-2014-golden-gate-ruby-conference/gogaruco-2013-4.jpg %}
</p>

<p>
{% img /images/2014-08-13-2014-golden-gate-ruby-conference/gogaruco-2013-5.jpg %}
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Available for Consulting</h2>
<div class="outline-text-2" id="text-3">
<p>
If you'd like to meet me around the time of GoGaRuCo, don't hesitate to email me
to try to meet up in person. Possibly you might have a project that could use my
help?
</p>

<p>
On a personal note, I spent the better part of my adulthood in San Francisco, so
I've got tons of friends there. All my consulting clients tend to be from the
Bay Area as well.
</p>
</div>
</div>
